https://github.com/codebasics/py/blob/master/pandas/21_sql/pandas_sql.ipynb

In [3]:
# !conda install pymysql --yes
# !conda install sqlalchemy --yes

Collecting package metadata (current_repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /home/animesh/miniconda3

  added / updated specs:
    - sqlalchemy


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    greenlet-3.0.1             |  py310h6a678d5_0         210 KB
    sqlalchemy-2.0.25          |  py310h5eee18b_0         3.1 MB
    ------------------------------------------------------------
                                           Total:         3.3 MB

The following NEW packages will be INSTALLED:

  greenlet           pkgs/main/linux-64::greenlet-3.0.1-py310h6a678d5_0
  sqlalchemy         pkgs/main/linux-64::sqlalchemy-2.0.25-py310h5eee18b_0



Downloading and Extracting Packages:
sqlalchemy-2.0.25    | 3.1 MB    |                                       |   0%
sqlalchemy-2.0.25    | 3.1 MB    | 1                                     |   0%
sqlalchemy-2.0.25    | 3.1 MB    | #4                                    |   4%
sqlalchemy-2.0.25    | 3.1 MB    | ####5                                 |  12%
greenlet-3.0.1       | 210 KB    | ##################################### | 100%


Preparing transaction: done
Verifying transaction: done
Executing transaction: done

In [1]:
import pandas as pd
import sqlalchemy

In [18]:
# in password chose the password of your database
connection_string='mysql+pymysql://root:password@localhost:3306/application'

In [22]:
engine = sqlalchemy.create_engine(connection_string)

In [24]:
df = pd.read_sql_table('customers',engine)
df

   id    name     phone
0   1  Donald  12345678
1   2    Bill  87654321
2   3    Elon  12348765

In [25]:
df = pd.read_sql_table('customers', engine, columns=["name"])
df

     name
0  Donald
1    Bill
2    Elon

In [26]:
df = pd.read_sql_query("select id,name from customers",engine)
df

   id    name
0   1  Donald
1   2    Bill
2   3    Elon

In [29]:
query = '''
 SELECT customers.name, customers.phone, orders.name, orders.amount
 FROM customers INNER JOIN orders
 ON customers.id=orders.customer_id
'''
df = pd.read_sql_query(query,engine)
df

     name     phone          name  amount
0    Bill  87654321      yoga mat      20
1  Donald  12345678  Google Pixel     950
2    Elon  12348765  Fossil Watch     120

In [31]:
pd.read_sql("customers",engine)

   id    name     phone
0   1  Donald  12345678
1   2    Bill  87654321
2   3    Elon  12348765

In [32]:
df = pd.read_csv("customers.csv")
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [33]:
df.rename(columns={
    'Customer Name': 'name',
    'Customer Phone': 'phone'
}, inplace=True)
df

              name       phone
0     rafael nadal  4567895647
1  maria sharapova   434534545
2   vladimir putin    89345345
3      kim un jong   123434456
4       jeff bezos   934534543
5     rahul gandhi    44324222

In [34]:
df.to_sql(
    name='customers', # database table name
    con=engine,
    if_exists='append',
    index=False
)

6

In [38]:
pd.read_sql("customers",engine,index_col='id')

               name       phone
id
1            Donald    12345678
2              Bill    87654321
3              Elon    12348765
4      rafael nadal  4567895647
5   maria sharapova   434534545
6    vladimir putin    89345345
7       kim un jong   123434456
8        jeff bezos   934534543
9      rahul gandhi    44324222